K7MDL2/KEITHSDR/SDR_RA8875/Libraries/cores_IDE_2.0_1.57.2/boards.txt
teensyMM.name=Teensy MicroMod
#teensyMM.upload.maximum_size=16515072
teensyMM.build.board=TEENSY_MICROMOD
teensyMM.build.flags.ld=-Wl,--gc-sections,--relax "-T{build.core.path}/imxrt1062_mm.ld"
#teensyMM.upload.maximum_data_size=524288
#teensyMM.upload.maximum_data_size=1048576
teensyMM.upload.tool=teensyloader
teensyMM.upload.tool.default=teensyloader
teensyMM.upload.tool.teensy=teensyloader
teensyMM.upload.protocol=teensy
teensyMM.upload_port.modelID=0x26
teensyMM.build.core=teensy4
teensyMM.build.mcu=imxrt1062
teensyMM.build.warn_data_percentage=99
teensyMM.build.toolchain=arm/bin/
teensyMM.build.command.gcc=arm-none-eabi-gcc
teensyMM.build.command.g++=arm-none-eabi-g++
teensyMM.build.command.ar=arm-none-eabi-gcc-ar
teensyMM.build.command.objcopy=arm-none-eabi-objcopy
teensyMM.build.command.objdump=arm-none-eabi-objdump
teensyMM.build.command.linker=arm-none-eabi-gcc
teensyMM.build.command.size=arm-none-eabi-size
teensyMM.build.flags.common=-g -Wall -ffunction-sections -fdata-sections -nostdlib
teensyMM.build.flags.dep=-MMD
teensyMM.build.flags.optimize=-Os
teensyMM.build.flags.cpu=-mthumb -mcpu=cortex-m7 -mfloat-abi=hard -mfpu=fpv5-d16
teensyMM.build.flags.defs=-D__IMXRT1062__ -DTEENSYDUINO=157
teensyMM.build.flags.cpp=-std=gnu++14 -fno-exceptions -fpermissive -fno-rtti -fno-threadsafe-statics -felide-constructors -Wno-error=narrowing
teensyMM.build.flags.c=
teensyMM.build.flags.S=-x assembler-with-cpp
teensyMM.build.flags.libs=-larm_cortexM7lfsp_math -lm -lstdc++
teensyMM.serial.restart_cmd=false
teensyMM.menu.usb.serial=Serial
teensyMM.menu.usb.serial.build.usbtype=USB_SERIAL
teensyMM.menu.usb.serial.upload_port.usbtype=USB_SERIAL
teensyMM.menu.usb.serial2=Dual Serial
teensyMM.menu.usb.serial2.build.usbtype=USB_DUAL_SERIAL
teensyMM.menu.usb.serial2.upload_port.usbtype=USB_DUAL_SERIAL
teensyMM.menu.usb.serial3=Triple Serial
teensyMM.menu.usb.serial3.build.usbtype=USB_TRIPLE_SERIAL
teensyMM.menu.usb.serial3.upload_port.usbtype=USB_TRIPLE_SERIAL
teensyMM.menu.usb.keyboard=Keyboard
teensyMM.menu.usb.keyboard.build.usbtype=USB_KEYBOARDONLY
teensyMM.menu.usb.keyboard.upload_port.usbtype=USB_KEYBOARDONLY
teensyMM.menu.usb.keyboard.fake_serial=teensy_gateway
teensyMM.menu.usb.touch=Keyboard + Touch Screen
teensyMM.menu.usb.touch.build.usbtype=USB_TOUCHSCREEN
teensyMM.menu.usb.touch.upload_port.usbtype=USB_TOUCHSCREEN
teensyMM.menu.usb.touch.fake_serial=teensy_gateway
teensyMM.menu.usb.hidtouch=Keyboard + Mouse + Touch Screen
teensyMM.menu.usb.hidtouch.build.usbtype=USB_HID_TOUCHSCREEN
teensyMM.menu.usb.hidtouch.upload_port.usbtype=USB_HID_TOUCHSCREEN
teensyMM.menu.usb.hidtouch.fake_serial=teensy_gateway
teensyMM.menu.usb.hid=Keyboard + Mouse + Joystick
teensyMM.menu.usb.hid.build.usbtype=USB_HID
teensyMM.menu.usb.hid.upload_port.usbtype=USB_HID
teensyMM.menu.usb.hid.fake_serial=teensy_gateway
teensyMM.menu.usb.serialhid=Serial + Keyboard + Mouse + Joystick
teensyMM.menu.usb.serialhid.build.usbtype=USB_SERIAL_HID
teensyMM.menu.usb.serialhid.upload_port.usbtype=USB_SERIAL_HID
teensyMM.menu.usb.midi=MIDI
teensyMM.menu.usb.midi.build.usbtype=USB_MIDI
teensyMM.menu.usb.midi.upload_port.usbtype=USB_MIDI
teensyMM.menu.usb.midi.fake_serial=teensy_gateway
teensyMM.menu.usb.midi4=MIDIx4
teensyMM.menu.usb.midi4.build.usbtype=USB_MIDI4
teensyMM.menu.usb.midi4.upload_port.usbtype=USB_MIDI4
teensyMM.menu.usb.midi4.fake_serial=teensy_gateway
teensyMM.menu.usb.midi16=MIDIx16
teensyMM.menu.usb.midi16.build.usbtype=USB_MIDI16
teensyMM.menu.usb.midi16.upload_port.usbtype=USB_MIDI16
teensyMM.menu.usb.midi16.fake_serial=teensy_gateway
teensyMM.menu.usb.serialmidi=Serial + MIDI
teensyMM.menu.usb.serialmidi.build.usbtype=USB_MIDI_SERIAL
teensyMM.menu.usb.serialmidi.upload_port.usbtype=USB_MIDI_SERIAL
teensyMM.menu.usb.serialmidi4=Serial + MIDIx4
teensyMM.menu.usb.serialmidi4.build.usbtype=USB_MIDI4_SERIAL
teensyMM.menu.usb.serialmidi4.upload_port.usbtype=USB_MIDI4_SERIAL
teensyMM.menu.usb.serialmidi16=Serial + MIDIx16
teensyMM.menu.usb.serialmidi16.build.usbtype=USB_MIDI16_SERIAL
teensyMM.menu.usb.serialmidi16.upload_port.usbtype=USB_MIDI16_SERIAL
teensyMM.menu.usb.audio=Audio
teensyMM.menu.usb.audio.build.usbtype=USB_AUDIO
teensyMM.menu.usb.audio.upload_port.usbtype=USB_AUDIO
teensyMM.menu.usb.audio.fake_serial=teensy_gateway
teensyMM.menu.usb.serialmidiaudio=Serial + MIDI + Audio
teensyMM.menu.usb.serialmidiaudio.build.usbtype=USB_MIDI_AUDIO_SERIAL
teensyMM.menu.usb.serialmidiaudio.upload_port.usbtype=USB_MIDI_AUDIO_SERIAL
teensyMM.menu.usb.serialmidi16audio=Serial + MIDIx16 + Audio
teensyMM.menu.usb.serialmidi16audio.build.usbtype=USB_MIDI16_AUDIO_SERIAL
teensyMM.menu.usb.serialmidi16audio.upload_port.usbtype=USB_MIDI16_AUDIO_SERIAL
teensyMM.menu.usb.mtp=MTP Disk (Experimental)
teensyMM.menu.usb.mtp.build.usbtype=USB_MTPDISK
teensyMM.menu.usb.mtp.upload_port.usbtype=USB_MTPDISK
teensyMM.menu.usb.mtp.fake_serial=teensy_gateway
teensyMM.menu.usb.serialmtp=Serial + MTP Disk (Experimental)
teensyMM.menu.usb.serialmtp.build.usbtype=USB_MTPDISK_SERIAL
teensyMM.menu.usb.serialmtp.upload_port.usbtype=USB_MTPDISK_SERIAL
teensyMM.menu.usb.rawhid=Raw HID
teensyMM.menu.usb.rawhid.build.usbtype=USB_RAWHID
teensyMM.menu.usb.rawhid.upload_port.usbtype=USB_RAWHID
teensyMM.menu.usb.rawhid.fake_serial=teensy_gateway
teensyMM.menu.usb.flightsim=Flight Sim Controls
teensyMM.menu.usb.flightsim.build.usbtype=USB_FLIGHTSIM
teensyMM.menu.usb.flightsim.upload_port.usbtype=USB_FLIGHTSIM
teensyMM.menu.usb.flightsim.fake_serial=teensy_gateway
teensyMM.menu.usb.flightsimjoystick=Flight Sim Controls + Joystick
teensyMM.menu.usb.flightsimjoystick.build.usbtype=USB_FLIGHTSIM_JOYSTICK
teensyMM.menu.usb.flightsimjoystick.upload_port.usbtype=USB_FLIGHTSIM_JOYSTICK
teensyMM.menu.usb.flightsimjoystick.fake_serial=teensy_gateway
#teensyMM.menu.usb.disable=No USB
#teensyMM.menu.usb.disable.build.usbtype=USB_DISABLED

teensyMM.menu.speed.600=600 MHz
teensyMM.menu.speed.528=528 MHz
teensyMM.menu.speed.450=450 MHz
teensyMM.menu.speed.396=396 MHz
teensyMM.menu.speed.150=150 MHz
teensyMM.menu.speed.24=24 MHz
teensyMM.menu.speed.720=720 MHz (overclock)
teensyMM.menu.speed.816=816 MHz (overclock)
teensyMM.menu.speed.912=912 MHz (overclock, cooling req'd)
teensyMM.menu.speed.960=960 MHz (overclock, cooling req'd)
teensyMM.menu.speed.1008=1.008 GHz (overclock, cooling req'd)
teensyMM.menu.speed.1008.build.fcpu=1008000000
teensyMM.menu.speed.960.build.fcpu=960000000
teensyMM.menu.speed.912.build.fcpu=912000000
teensyMM.menu.speed.816.build.fcpu=816000000
teensyMM.menu.speed.720.build.fcpu=720000000
teensyMM.menu.speed.600.build.fcpu=600000000
teensyMM.menu.speed.528.build.fcpu=528000000
teensyMM.menu.speed.450.build.fcpu=450000000
teensyMM.menu.speed.396.build.fcpu=396000000
teensyMM.menu.speed.150.build.fcpu=150000000
teensyMM.menu.speed.24.build.fcpu=24000000

teensyMM.menu.opt.o2std=Faster
teensyMM.menu.opt.o2std.build.flags.optimize=-O2
teensyMM.menu.opt.o2std.build.flags.ldspecs=
#teensyMM.menu.opt.o2lto=Faster with LTO
#teensyMM.menu.opt.o2lto.build.flags.optimize=-O2 -flto -fno-fat-lto-objects
#teensyMM.menu.opt.o2lto.build.flags.ldspecs=-fuse-linker-plugin
teensyMM.menu.opt.o1std=Fast
teensyMM.menu.opt.o1std.build.flags.optimize=-O1
teensyMM.menu.opt.o1std.build.flags.ldspecs=
#teensyMM.menu.opt.o1lto=Fast with LTO
#teensyMM.menu.opt.o1lto.build.flags.optimize=-O1 -flto -fno-fat-lto-objects
#teensyMM.menu.opt.o1lto.build.flags.ldspecs=-fuse-linker-plugin
teensyMM.menu.opt.o3std=Fastest
teensyMM.menu.opt.o3std.build.flags.optimize=-O3
teensyMM.menu.opt.o3std.build.flags.ldspecs=
#teensyMM.menu.opt.o3purestd=Fastest + pure-code
#teensyMM.menu.opt.o3purestd.build.flags.optimize=-O3 -mpure-code -D__PURE_CODE__
#teensyMM.menu.opt.o3purestd.build.flags.ldspecs=
#teensyMM.menu.opt.o3lto=Fastest with LTO
#teensyMM.menu.opt.o3lto.build.flags.optimize=-O3 -flto -fno-fat-lto-objects
#teensyMM.menu.opt.o3lto.build.flags.ldspecs=-fuse-linker-plugin
#teensyMM.menu.opt.o3purelto=Fastest + pure-code with LTO
#teensyMM.menu.opt.o3purelto.build.flags.optimize=-O3 -mpure-code -D__PURE_CODE__ -flto -fno-fat-lto-objects
#teensyMM.menu.opt.o3purelto.build.flags.ldspecs=-fuse-linker-plugin
teensyMM.menu.opt.ogstd=Debug
teensyMM.menu.opt.ogstd.build.flags.optimize=-Og
teensyMM.menu.opt.ogstd.build.flags.ldspecs=
#teensyMM.menu.opt.oglto=Debug with LTO
#teensyMM.menu.opt.oglto.build.flags.optimize=-Og -flto -fno-fat-lto-objects
#teensyMM.menu.opt.oglto.build.flags.ldspecs=-fuse-linker-plugin
teensyMM.menu.opt.osstd=Smallest Code
teensyMM.menu.opt.osstd.build.flags.optimize=-Os --specs=nano.specs
teensyMM.menu.opt.osstd.build.flags.ldspecs=
#teensyMM.menu.opt.oslto=Smallest Code with LTO
#teensyMM.menu.opt.oslto.build.flags.optimize=-Os -flto -fno-fat-lto-objects --specs=nano.specs
#teensyMM.menu.opt.oslto.build.flags.ldspecs=-fuse-linker-plugin

teensyMM.menu.keys.en-us=US English
teensyMM.menu.keys.en-us.build.keylayout=US_ENGLISH
teensyMM.menu.keys.fr-ca=Canadian French
teensyMM.menu.keys.fr-ca.build.keylayout=CANADIAN_FRENCH
teensyMM.menu.keys.xx-ca=Canadian Multilingual
teensyMM.menu.keys.xx-ca.build.keylayout=CANADIAN_MULTILINGUAL
teensyMM.menu.keys.cz-cz=Czech
teensyMM.menu.keys.cz-cz.build.keylayout=CZECH
teensyMM.menu.keys.da-da=Danish
teensyMM.menu.keys.da-da.build.keylayout=DANISH
teensyMM.menu.keys.fi-fi=Finnish
teensyMM.menu.keys.fi-fi.build.keylayout=FINNISH
teensyMM.menu.keys.fr-fr=French
teensyMM.menu.keys.fr-fr.build.keylayout=FRENCH
teensyMM.menu.keys.fr-be=French Belgian
teensyMM.menu.keys.fr-be.build.keylayout=FRENCH_BELGIAN
teensyMM.menu.keys.fr-ch=French Swiss
teensyMM.menu.keys.fr-ch.build.keylayout=FRENCH_SWISS
teensyMM.menu.keys.de-de=German
teensyMM.menu.keys.de-de.build.keylayout=GERMAN
teensyMM.menu.keys.de-dm=German (Mac)
teensyMM.menu.keys.de-dm.build.keylayout=GERMAN_MAC
teensyMM.menu.keys.de-ch=German Swiss
teensyMM.menu.keys.de-ch.build.keylayout=GERMAN_SWISS
teensyMM.menu.keys.is-is=Icelandic
teensyMM.menu.keys.is-is.build.keylayout=ICELANDIC
teensyMM.menu.keys.en-ie=Irish
teensyMM.menu.keys.en-ie.build.keylayout=IRISH
teensyMM.menu.keys.it-it=Italian
teensyMM.menu.keys.it-it.build.keylayout=ITALIAN
teensyMM.menu.keys.no-no=Norwegian
teensyMM.menu.keys.no-no.build.keylayout=NORWEGIAN
teensyMM.menu.keys.pt-pt=Portuguese
teensyMM.menu.keys.pt-pt.build.keylayout=PORTUGUESE
teensyMM.menu.keys.pt-br=Portuguese Brazilian
teensyMM.menu.keys.pt-br.build.keylayout=PORTUGUESE_BRAZILIAN
teensyMM.menu.keys.rs-rs=Serbian (Latin Only)
teensyMM.menu.keys.rs-rs.build.keylayout=SERBIAN_LATIN_ONLY
teensyMM.menu.keys.es-es=Spanish
teensyMM.menu.keys.es-es.build.keylayout=SPANISH
teensyMM.menu.keys.es-mx=Spanish Latin America
teensyMM.menu.keys.es-mx.build.keylayout=SPANISH_LATIN_AMERICA
teensyMM.menu.keys.sv-se=Swedish
teensyMM.menu.keys.sv-se.build.keylayout=SWEDISH
teensyMM.menu.keys.tr-tr=Turkish (partial)
teensyMM.menu.keys.tr-tr.build.keylayout=TURKISH
teensyMM.menu.keys.en-gb=United Kingdom
teensyMM.menu.keys.en-gb.build.keylayout=UNITED_KINGDOM
teensyMM.menu.keys.usint=US International
teensyMM.menu.keys.usint.build.keylayout=US_INTERNATIONAL




teensy40.name=Teensy 4.0
#teensy40.upload.maximum_size=2031616
teensy40.build.board=TEENSY40
teensy40.build.flags.ld=-Wl,--gc-sections,--relax "-T{build.core.path}/imxrt1062.ld"
#teensy40.upload.maximum_data_size=524288
#teensy40.upload.maximum_data_size=1048576
teensy40.upload.tool=teensyloader
teensy40.upload.tool.default=teensyloader
teensy40.upload.tool.teensy=teensyloader
teensy40.upload.protocol=teensy
teensy40.upload_port.modelID=0x24
teensy40.build.core=teensy4
teensy40.build.mcu=imxrt1062
teensy40.build.warn_data_percentage=99
teensy40.build.toolchain=arm/bin/
teensy40.build.command.gcc=arm-none-eabi-gcc
teensy40.build.command.g++=arm-none-eabi-g++
teensy40.build.command.ar=arm-none-eabi-gcc-ar
teensy40.build.command.objcopy=arm-none-eabi-objcopy
teensy40.build.command.objdump=arm-none-eabi-objdump
teensy40.build.command.linker=arm-none-eabi-gcc
teensy40.build.command.size=arm-none-eabi-size
teensy40.build.flags.common=-g -Wall -ffunction-sections -fdata-sections -nostdlib
teensy40.build.flags.dep=-MMD
teensy40.build.flags.optimize=-Os
teensy40.build.flags.cpu=-mthumb -mcpu=cortex-m7 -mfloat-abi=hard -mfpu=fpv5-d16
teensy40.build.flags.defs=-D__IMXRT1062__ -DTEENSYDUINO=157
teensy40.build.flags.cpp=-std=gnu++14 -fno-exceptions -fpermissive -fno-rtti -fno-threadsafe-statics -felide-constructors -Wno-error=narrowing
teensy40.build.flags.c=
teensy40.build.flags.S=-x assembler-with-cpp
teensy40.build.flags.libs=-larm_cortexM7lfsp_math -lm -lstdc++
teensy40.serial.restart_cmd=false
teensy40.menu.usb.serial=Serial
teensy40.menu.usb.serial.build.usbtype=USB_SERIAL
teensy40.menu.usb.serial.upload_port.usbtype=USB_SERIAL
teensy40.menu.usb.serial2=Dual Serial
teensy40.menu.usb.serial2.build.usbtype=USB_DUAL_SERIAL
teensy40.menu.usb.serial2.upload_port.usbtype=USB_DUAL_SERIAL
teensy40.menu.usb.serial3=Triple Serial
teensy40.menu.usb.serial3.build.usbtype=USB_TRIPLE_SERIAL
teensy40.menu.usb.serial3.upload_port.usbtype=USB_TRIPLE_SERIAL
teensy40.menu.usb.keyboard=Keyboard
teensy40.menu.usb.keyboard.build.usbtype=USB_KEYBOARDONLY
teensy40.menu.usb.keyboard.upload_port.usbtype=USB_KEYBOARDONLY
teensy40.menu.usb.keyboard.fake_serial=teensy_gateway
teensy40.menu.usb.touch=Keyboard + Touch Screen
teensy40.menu.usb.touch.build.usbtype=USB_TOUCHSCREEN
teensy40.menu.usb.touch.upload_port.usbtype=USB_TOUCHSCREEN
teensy40.menu.usb.touch.fake_serial=teensy_gateway
teensy40.menu.usb.hidtouch=Keyboard + Mouse + Touch Screen
teensy40.menu.usb.hidtouch.build.usbtype=USB_HID_TOUCHSCREEN
teensy40.menu.usb.hidtouch.upload_port.usbtype=USB_HID_TOUCHSCREEN
teensy40.menu.usb.hidtouch.fake_serial=teensy_gateway
teensy40.menu.usb.hid=Keyboard + Mouse + Joystick
teensy40.menu.usb.hid.build.usbtype=USB_HID
teensy40.menu.usb.hid.upload_port.usbtype=USB_HID
teensy40.menu.usb.hid.fake_serial=teensy_gateway
teensy40.menu.usb.serialhid=Serial + Keyboard + Mouse + Joystick
teensy40.menu.usb.serialhid.build.usbtype=USB_SERIAL_HID
teensy40.menu.usb.serialhid.upload_port.usbtype=USB_SERIAL_HID
teensy40.menu.usb.midi=MIDI
teensy40.menu.usb.midi.build.usbtype=USB_MIDI
teensy40.menu.usb.midi.upload_port.usbtype=USB_MIDI
teensy40.menu.usb.midi.fake_serial=teensy_gateway
teensy40.menu.usb.midi4=MIDIx4
teensy40.menu.usb.midi4.build.usbtype=USB_MIDI4
teensy40.menu.usb.midi4.upload_port.usbtype=USB_MIDI4
teensy40.menu.usb.midi4.fake_serial=teensy_gateway
teensy40.menu.usb.midi16=MIDIx16
teensy40.menu.usb.midi16.build.usbtype=USB_MIDI16
teensy40.menu.usb.midi16.upload_port.usbtype=USB_MIDI16
teensy40.menu.usb.midi16.fake_serial=teensy_gateway
teensy40.menu.usb.serialmidi=Serial + MIDI
teensy40.menu.usb.serialmidi.build.usbtype=USB_MIDI_SERIAL
teensy40.menu.usb.serialmidi.upload_port.usbtype=USB_MIDI_SERIAL
teensy40.menu.usb.serialmidi4=Serial + MIDIx4
teensy40.menu.usb.serialmidi4.build.usbtype=USB_MIDI4_SERIAL
teensy40.menu.usb.serialmidi4.upload_port.usbtype=USB_MIDI4_SERIAL
teensy40.menu.usb.serialmidi16=Serial + MIDIx16
teensy40.menu.usb.serialmidi16.build.usbtype=USB_MIDI16_SERIAL
teensy40.menu.usb.serialmidi16.upload_port.usbtype=USB_MIDI16_SERIAL
teensy40.menu.usb.audio=Audio
teensy40.menu.usb.audio.build.usbtype=USB_AUDIO
teensy40.menu.usb.audio.upload_port.usbtype=USB_AUDIO
teensy40.menu.usb.audio.fake_serial=teensy_gateway
teensy40.menu.usb.serialmidiaudio=Serial + MIDI + Audio
teensy40.menu.usb.serialmidiaudio.build.usbtype=USB_MIDI_AUDIO_SERIAL
teensy40.menu.usb.serialmidiaudio.upload_port.usbtype=USB_MIDI_AUDIO_SERIAL
teensy40.menu.usb.serialmidi16audio=Serial + MIDIx16 + Audio
teensy40.menu.usb.serialmidi16audio.build.usbtype=USB_MIDI16_AUDIO_SERIAL
teensy40.menu.usb.serialmidi16audio.upload_port.usbtype=USB_MIDI16_AUDIO_SERIAL
teensy40.menu.usb.mtp=MTP Disk (Experimental)
teensy40.menu.usb.mtp.build.usbtype=USB_MTPDISK
teensy40.menu.usb.mtp.upload_port.usbtype=USB_MTPDISK
teensy40.menu.usb.mtp.fake_serial=teensy_gateway
teensy40.menu.usb.serialmtp=Serial + MTP Disk (Experimental)
teensy40.menu.usb.serialmtp.build.usbtype=USB_MTPDISK_SERIAL
teensy40.menu.usb.serialmtp.upload_port.usbtype=USB_MTPDISK_SERIAL
teensy40.menu.usb.rawhid=Raw HID
teensy40.menu.usb.rawhid.build.usbtype=USB_RAWHID
teensy40.menu.usb.rawhid.upload_port.usbtype=USB_RAWHID
teensy40.menu.usb.rawhid.fake_serial=teensy_gateway
teensy40.menu.usb.flightsim=Flight Sim Controls
teensy40.menu.usb.flightsim.build.usbtype=USB_FLIGHTSIM
teensy40.menu.usb.flightsim.upload_port.usbtype=USB_FLIGHTSIM
teensy40.menu.usb.flightsim.fake_serial=teensy_gateway
teensy40.menu.usb.flightsimjoystick=Flight Sim Controls + Joystick
teensy40.menu.usb.flightsimjoystick.build.usbtype=USB_FLIGHTSIM_JOYSTICK
teensy40.menu.usb.flightsimjoystick.upload_port.usbtype=USB_FLIGHTSIM_JOYSTICK
teensy40.menu.usb.flightsimjoystick.fake_serial=teensy_gateway
#teensy40.menu.usb.disable=No USB
#teensy40.menu.usb.disable.build.usbtype=USB_DISABLED

